# Task
### Chiptole.tsv Dataset
https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv

### Beer.txt Dataset
https://raw.githubusercontent.com/justmarkham/DAT8/master/data/beer.txt

### US_Crime_Rates_1960_2014.csv DataSet
https://gist.githubusercontent.com/ganeshbabuNN/9ef28b5313d52b0007e8de63c33ff435/raw/f69899e2ad7798bc64692f080272821c84e29a07/US_Crime_Rates_1960_2014.csv

### vincentarelbundock openintro causaldata HMLdiag
https://raw.githubusercontent.com/vincentarelbundock/Rdatasets/master/datasets.csv

### Ineuron Practise Examples in  Pandas
https://drive.google.com/file/d/1etGP85wJWsgqbsh3gX5oxc8dPKLMA1eT/view

### 1 .IMPORTING DATA

In [2]:
import pandas as pd

In [4]:
### From a CSV file
df1 = pd.read_csv("https://gist.githubusercontent.com/ganeshbabuNN/9ef28b5313d52b0007e8de63c33ff435/raw/f69899e2ad7798bc64692f080272821c84e29a07/US_Crime_Rates_1960_2014.csv")
df1.head(2)

,Year,Population,Total,Violent,Property,Murder,Forcible_Rape,Robbery,Aggravated_assault,Burglary,Larceny_Theft,Vehicle_Theft
0,1960,179323175,3384200,288460,3095700,9110,17190,107840,154320,912100,1855400,328200
1,1961,182992000,3488000,289390,3198600,8740,17220,106670,156760,949600,1913000,336000

In [7]:
### - From a delimited text file (like TSV)
df2 = pd.read_table("https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv")
df2.head(2)

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39

In [8]:
### - From a delimited text file (like TSV)
df2 = pd.read_table("https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv", sep='\t')
df2.head(2)

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39

In [3]:
cd M:\01 FSDS ineuron\Python Module\Classes\0020 Pandas\datasets

M:\01 FSDS ineuron\Python Module\Classes\0020 Pandas\datasets

In [6]:
### From an Excel file
import openpyxl
import pandas as pd
df3 = pd.read_excel("fsi-2021.xlsx" , engine='openpyxl')
df3.head(2)

,Country,Year,Rank,Total,C1: Security Apparatus,C2: Factionalized Elites,C3: Group Grievance,E1: Economy,E2: Economic Inequality,E3: Human Flight and Brain Drain,P1: State Legitimacy,P2: Public Services,P3: Human Rights,S1: Demographic Pressures,S2: Refugees and IDPs,X1: External Intervention
0,Yemen,2021,1st,111.7,9.4,10.0,9.4,9.8,7.7,6.7,9.9,9.8,9.7,9.8,9.8,9.7
1,Somalia,2021,2nd,110.9,9.3,10.0,8.3,9.2,9.5,8.8,9.2,9.8,8.7,10.0,9.2,8.9

In [15]:
### Reads from a SQL table/database
import mysql.connector as connection
conn = connection.connect(host="127.0.0.1", database = "practise" ,user="root", passwd="Bharadwaja01",use_pure=True)
df4 = pd.read_sql("show databases", conn)
df4.head(2)

             Database
0     carbonnanotubes
1  information_schema

In [16]:
### Reads from a JSON  formatted string, URL or file.
df5 = pd.read_json('https://api.github.com/repos/pandas-dev/pandas/issues')
df5.head(2)

,url,repository_url,labels_url,comments_url,events_url,html_url,id,node_id,number,title,...,milestone,comments,created_at,updated_at,closed_at,author_association,active_lock_reason,body,performed_via_github_app,pull_request
0,https://api.github.com/repos/pandas-dev/pandas...,https://api.github.com/repos/pandas-dev/pandas,https://api.github.com/repos/pandas-dev/pandas...,https://api.github.com/repos/pandas-dev/pandas...,https://api.github.com/repos/pandas-dev/pandas...,https://github.com/pandas-dev/pandas/issues/41865,914243317,MDU6SXNzdWU5MTQyNDMzMTc=,41865,Timezone specification like +HHMM without colo...,...,None,0,2021-06-08 03:22:56+00:00,2021-06-08 03:22:56+00:00,NaT,NONE,NaN,- [x] I have checked that this issue has not a...,NaN,NaN
1,https://api.github.com/repos/pandas-dev/pandas...,https://api.github.com/repos/pandas-dev/pandas,https://api.github.com/repos/pandas-dev/pandas...,https://api.github.com/repos/pandas-dev/pandas...,https://api.github.com/repos/pandas-dev/pandas...,https://github.com/pandas-dev/pandas/pull/41864,914237758,MDExOlB1bGxSZXF1ZXN0NjY0MTY5OTMz,41864,Clean up ujson initialization,...,None,0,2021-06-08 03:17:34+00:00,2021-06-08 03:17:34+00:00,NaT,MEMBER,NaN,The way we do this now is a little wonky as we...,NaN,{'url': 'https://api.github.com/repos/pandas-d...

In [22]:
### Parses an html URL, string or  file and extracts tables to a list of dataframes
df6=pd.read_html('''https://www.basketball-reference.com/players/i/ibakase01.html?utm_source=direct&utm_medium=Share&utm_campaign=ShareTool
''')
df6[2].head(2)

,Season,Age,Tm,Lg,Pos,G,GS,MP,FG,FGA,...,DRB,TRB,AST,STL,BLK,TOV,PF,PTS,Unnamed: 30,Trp Dbl
0,2009-10,20.0,OKC,NBA,PF,73.0,0.0,1323.0,201.0,370.0,...,259.0,397.0,10.0,25.0,97.0,68.0,194.0,461.0,NaN,0.0
1,2010-11,21.0,OKC,NBA,PF,82.0,44.0,2216.0,335.0,617.0,...,408.0,622.0,22.0,31.0,198.0,71.0,267.0,808.0,NaN,0.0

### Select table, copy and run below command

In [28]:
###  Takes the contents of your clipboard and passes it to read_table()
df7 = pd.read_clipboard() 
df7

             Database
0     carbonnanotubes
1  information_schema

In [ ]:
###  From a dict, keys for 
columns names, values for data as lists
pd.DataFrame(dict)

### CREATE TEST OBJECTS

In [5]:
np.random.rand(5,5)

array([[0.74977183, 0.39238808, 0.16432684, 0.23859807, 0.21221121],
       [0.50151193, 0.37193842, 0.36090038, 0.72678036, 0.65377526],
       [0.85390553, 0.45100797, 0.24705441, 0.46560928, 0.06128624],
       [0.40919529, 0.26028573, 0.83211298, 0.53503766, 0.08896129],
       [0.47348466, 0.43662818, 0.07385645, 0.99993966, 0.0771838 ]])

In [25]:
import pandas as pd
import numpy as np
df = pd.DataFrame(np.random.rand(5,5))
df

          0         1         2         3         4
0  0.329579  0.388073  0.142658  0.497346  0.337940
1  0.875608  0.951857  0.403505  0.687571  0.961991
2  0.595665  0.310376  0.719283  0.726838  0.646611
3  0.652885  0.106864  0.755165  0.044254  0.735911
4  0.672025  0.540250  0.660234  0.148890  0.161194

In [8]:
my_list = [1,2,3]
print(my_list)
print(type(my_list))
a = pd.Series(my_list)
print(type(a))
print(a)

[1, 2, 3]
<class 'list'>
<class 'pandas.core.series.Series'>
0    1
1    2
2    3
dtype: int64

### TSV dataframe

In [211]:
### - From a delimited text file (like TSV)
df = pd.read_table("https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv")
df.head(2)

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39

In [37]:
df.shape

(4622, 5)

In [38]:
df.info

<bound method DataFrame.info of       order_id  quantity                              item_name  \
0            1         1           Chips and Fresh Tomato Salsa
1            1         1                                   Izze
2            1         1                       Nantucket Nectar
3            1         1  Chips and Tomatillo-Green Chili Salsa
4            2         2                           Chicken Bowl
...        ...       ...                                    ...
4617      1833         1                          Steak Burrito
4618      1833         1                          Steak Burrito
4619      1834         1                     Chicken Salad Bowl
4620      1834         1                     Chicken Salad Bowl
4621      1834         1                     Chicken Salad Bowl

                                     choice_description item_price
0                                                   NaN     $2.39
1                                          [Clementine]     $3.39
2                                               [Apple]     $3.39
3                                                   NaN     $2.39
4     [Tomatillo-Red Chili Salsa (Hot), [Black Beans...    $16.98
...                                                 ...        ...
4617  [Fresh Tomato Salsa, [Rice, Black Beans, Sour ...    $11.75
4618  [Fresh Tomato Salsa, [Rice, Sour Cream, Cheese...    $11.75
4619  [Fresh Tomato Salsa, [Fajita Vegetables, Pinto...    $11.25
4620  [Fresh Tomato Salsa, [Fajita Vegetables, Lettu...     $8.75
4621  [Fresh Tomato Salsa, [Fajita Vegetables, Pinto...     $8.75

[4622 rows x 5 columns]>

In [40]:
df.value_counts("item_price")

item_price
$8.75      730
$11.25     521
$9.25      398
$4.45      349
$8.49      311
          ...
$22.96       1
$4.36        1
$32.94       1
$33.75       1
$26.07       1
Length: 78, dtype: int64

In [42]:
df.value_counts("item_name").head(5)

item_name
Chicken Bowl           726
Chicken Burrito        553
Chips and Guacamole    479
Steak Burrito          368
Canned Soft Drink      301
dtype: int64

In [45]:
df["item_name"].head(5)

0             Chips and Fresh Tomato Salsa
1                                     Izze
2                         Nantucket Nectar
3    Chips and Tomatillo-Green Chili Salsa
4                             Chicken Bowl
Name: item_name, dtype: object

In [47]:
df[["item_name" , "item_price"]].head(5)

                               item_name item_price
0           Chips and Fresh Tomato Salsa     $2.39
1                                   Izze     $3.39
2                       Nantucket Nectar     $3.39
3  Chips and Tomatillo-Green Chili Salsa     $2.39
4                           Chicken Bowl    $16.98

In [55]:
df.loc[0:10:2]

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
2,1,1,Nantucket Nectar,[Apple],$3.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98
6,3,1,Side of Chips,NaN,$1.69
8,4,1,Steak Soft Tacos,"[Tomatillo Green Chili Salsa, [Pinto Beans, Ch...",$9.25
10,5,1,Chips and Guacamole,NaN,$4.45

In [56]:
df.iloc[0:10:2]

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
2,1,1,Nantucket Nectar,[Apple],$3.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98
6,3,1,Side of Chips,NaN,$1.69
8,4,1,Steak Soft Tacos,"[Tomatillo Green Chili Salsa, [Pinto Beans, Ch...",$9.25

In [57]:
df.shape

(4622, 5)

In [59]:
df.isnull().head()

   order_id  quantity  item_name  choice_description  item_price
0     False     False      False                True       False
1     False     False      False               False       False
2     False     False      False               False       False
3     False     False      False                True       False
4     False     False      False               False       False

In [63]:
df["choice_description"].isnull().head()

0     True
1    False
2    False
3     True
4    False
Name: choice_description, dtype: bool

In [99]:
a = df[df["choice_description"].isnull()].index
a

Int64Index([   0,    3,    6,   10,   14,   15,   20,   25,   30,   32,
            ...
            4582, 4584, 4588, 4596, 4598, 4600, 4605, 4613, 4614, 4616],
           dtype='int64', length=1246)

In [103]:
df.iloc[a].head(5)

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
6,3,1,Side of Chips,NaN,$1.69
10,5,1,Chips and Guacamole,NaN,$4.45
14,7,1,Chips and Guacamole,NaN,$4.45

In [104]:
len(df[df["choice_description"].isnull()].index)

1246

In [74]:
df.shape

(4622, 5)

In [105]:
df1 = df

In [73]:
df1.dropna().shape

(3376, 5)

In [75]:
4622 - 3376

1246

In [84]:
df.shape

(4622, 5)

In [80]:
df2 = df

In [83]:
a = df2.dropna(axis=1)
a.shape

(4622, 4)

In [89]:
b = df1.dropna(axis=1,thresh=3)
b.shape

(4622, 5)

In [93]:
df2 = df1.fillna("ABC")
df2.head(2)

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,ABC,$2.39
1,1,1,Izze,[Clementine],$3.39

In [115]:
df3 = df1[["order_id","quantity"]].astype(float)
df3.head()

   order_id  quantity
0       1.0       1.0
1       1.0       1.0
2       1.0       1.0
3       1.0       1.0
4       2.0       2.0

In [118]:
df3.replace(1,'one').head(5)

  order_id quantity
0      one      one
1      one      one
2      one      one
3      one      one
4        2        2

In [119]:
df2.head(2)

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,ABC,$2.39
1,1,1,Izze,[Clementine],$3.39

In [121]:
df2.replace([1,"Chips and Fresh Tomato Salsa","ABC"],["one","Veg","XYZ"]).head(2)

  order_id quantity item_name choice_description item_price
0      one      one       Veg                XYZ     $2.39
1      one      one      Izze       [Clementine]     $3.39

In [131]:
df2.rename(columns={'order_id': 'id'}).head(2)

   id  quantity                     item_name choice_description item_price
0   1         1  Chips and Fresh Tomato Salsa                ABC     $2.39
1   1         1                          Izze       [Clementine]     $3.39

In [135]:
df2.set_index('order_id').head(2)

          quantity                     item_name choice_description item_price
order_id
1                1  Chips and Fresh Tomato Salsa                ABC     $2.39
1                1                          Izze       [Clementine]     $3.39

In [ ]:
Chicken Bowl

In [147]:
df[df["item_name"] == "Chicken Bowl"].head(2)

,order_id,quantity,item_name,choice_description,item_price
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98
5,3,1,Chicken Bowl,"[Fresh Tomato Salsa (Mild), [Rice, Cheese, Sou...",$10.98

In [148]:
df25 = df[df["item_name"] == "Chicken Bowl"]

In [149]:
df25.head(2)

,order_id,quantity,item_name,choice_description,item_price
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98
5,3,1,Chicken Bowl,"[Fresh Tomato Salsa (Mild), [Rice, Cheese, Sou...",$10.98

In [178]:
df25[df25["quantity"] > 2]

,order_id,quantity,item_name,choice_description,item_price
409,178,3,Chicken Bowl,"[[Fresh Tomato Salsa (Mild), Tomatillo-Green C...",$32.94
1514,616,3,Chicken Bowl,"[Fresh Tomato Salsa, [Rice, Black Beans, Chees...",$26.25

In [181]:
df.head(2)

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39

In [183]:
df.dtypes

order_id               int64
quantity               int64
item_name             object
choice_description    object
item_price            object
dtype: object

In [190]:
df["item_price"][0][1:]

'2.39 '

In [191]:
float(df["item_price"][0][1:])

2.39

In [212]:
df.shape

(4622, 5)

In [213]:
l = []
for i in range(df.shape[0]):
    l.append(float(df["item_price"][i][1:]))

In [201]:
l[0:5]

[2.39, 3.39, 3.39, 2.39, 16.98]

In [215]:
df["float_item_price"] = l

In [216]:
df.head(5)

,order_id,quantity,item_name,choice_description,item_price,float_item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39,2.39
1,1,1,Izze,[Clementine],$3.39,3.39
2,1,1,Nantucket Nectar,[Apple],$3.39,3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39,2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98,16.98

In [217]:
df2 = df.drop(["item_price"] , axis=1)
df2.head(2)

,order_id,quantity,item_name,choice_description,float_item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,2.39
1,1,1,Izze,[Clementine],3.39

In [218]:
df2["Tot_price"] = df["quantity"] * df["float_item_price"]

In [219]:
df2.head(5)

,order_id,quantity,item_name,choice_description,float_item_price,Tot_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,2.39,2.39
1,1,1,Izze,[Clementine],3.39,3.39
2,1,1,Nantucket Nectar,[Apple],3.39,3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,2.39,2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",16.98,33.96

In [2]:
import numpy as np 
import matplotlib.pyplot as plt 
import pandas as pd 
from pandas import DataFrame, Series

In [4]:
l1 = [3,4,5]
l2 = [6,7,8]
l1+l2

[3, 4, 5, 6, 7, 8]

In [8]:
s1 = Series(range(12,16)) # -> 0, 1, 2, 3 
s2 = Series(range(1,5)) # -> 1, 2, 3, 4 
s1 + s2

0    13
1    15
2    17
3    19
dtype: int64

In [19]:
from io import StringIO 
data = """, Animal, Cuteness, Desirable 
row-1, dog, 8.7, True 
row-2, cat, 9.5, True 
row-3, bat, 2.6, False""" 
df = pd.read_csv(StringIO(data), header=0, 
  index_col=0,skipinitialspace=True)

In [20]:
df

      Animal  Cuteness Desirable
row-1    dog       8.7      True
row-2    cat       9.5      True
row-3    bat       2.6      False

In [21]:
s1 = Series(range(6)) 
s2 = s1 * s1 
s2.index = s2.index + 2 # misalign indexes 
df = pd.concat([s1, s2], axis=1) 
df

     0     1
0  0.0   NaN
1  1.0   NaN
2  2.0   0.0
3  3.0   1.0
4  4.0   4.0
5  5.0   9.0
6  NaN  16.0
7  NaN  25.0

In [25]:
s3 = Series({'Tom':1, 'Dick':4, 'Har':9 , 'Mar':5 }) 
s4 = Series({'Tom':3, 'Dick':2, 'Mar':5 , 'Har':9 }) 
df = pd.concat({'ABC':s3, 'DEF':s4 }, axis=1) 
df

      ABC  DEF
Tom     1    3
Dick    4    2
Har     9    9
Mar     5    5

In [26]:
s3 = Series({'Tom':1, 'Dick':4, 'Har':9 , 'Mar':5 }) 
s4 = Series({'Tom':3, 'Dick':2, 'Mar':5 , 'Har':9 }) 
df = pd.concat({'ABC':s3, 'DEF':s4 }, axis=0) 
df

ABC  Tom     1
     Dick    4
     Har     9
     Mar     5
DEF  Tom     3
     Dick    2
     Mar     5
     Har     9
dtype: int64

In [27]:
df = DataFrame({ 
 'col0' : [1.0, 2.0, 3.0, 4.0], 
 'col1' : [100, 200, 300, 400] 
 }) 
df

   col0  col1
0   1.0   100
1   2.0   200
2   3.0   300
3   4.0   400

In [28]:
df = DataFrame.from_dict({ # data by row 
 # rows as python dictionaries 
 'row0' : {'col0':0, 'col1':'A'}, 
 'row1' : {'col0':1, 'col1':'B'} 
 }, orient='index') 
df

      col0 col1
row0     0    A
row1     1    B

In [32]:
df = DataFrame.from_dict({ # data by row 
 # rows as python lists 
 'row0' : [1, 1+1j, 'A'], 
 'row1' : [2, 2+2j, 'B'] 
 }, orient='index') 
df

      0                   1  2
row0  1  1.000000+1.000000j  A
row1  2  2.000000+2.000000j  B

In [34]:
df = DataFrame(np.random.rand(5,5))
df

          0         1         2         3         4
0  0.106118  0.986283  0.438349  0.688792  0.978579
1  0.252289  0.132774  0.953656  0.673386  0.557216
2  0.604203  0.413122  0.965415  0.438292  0.909470
3  0.543470  0.362040  0.145629  0.595556  0.239288
4  0.406223  0.670763  0.028979  0.401410  0.342222

In [35]:
df = DataFrame(np.random.rand(5,5))
df

          0         1         2         3         4
0  0.726975  0.620957  0.784167  0.314502  0.919551
1  0.432410  0.511324  0.297579  0.289369  0.517095
2  0.251988  0.018400  0.230118  0.477994  0.902215
3  0.908752  0.882001  0.987383  0.641370  0.360910
4  0.578002  0.720426  0.004966  0.155745  0.182977

In [43]:
df.index = pd.date_range('1/1/2005', 
 periods=len(df) , freq='Y') 
df

                   0         1         2         3         4
2005-12-31  0.726975  0.620957  0.784167  0.314502  0.919551
2006-12-31  0.432410  0.511324  0.297579  0.289369  0.517095
2007-12-31  0.251988  0.018400  0.230118  0.477994  0.902215
2008-12-31  0.908752  0.882001  0.987383  0.641370  0.360910
2009-12-31  0.578002  0.720426  0.004966  0.155745  0.182977

In [48]:
# --- with alphabetic row and col indexes 
# and a "groupable" variable 
import string 
import random 
rows = 52 
cols = 5 
assert(1 <= rows <= 52) # min/max row count 
df = DataFrame(np.random.randn(rows, cols), 
 columns=['c'+str(i) for i in range(cols)], 
 index=list((string.ascii_uppercase + 
 string.ascii_lowercase)[0:rows])) 


df['groupable'] = [random.choice('abcde') 
 for _ in range(rows)]

In [49]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 52 entries, A to z
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   c0         52 non-null     float64
 1   c1         52 non-null     float64
 2   c2         52 non-null     float64
 3   c3         52 non-null     float64
 4   c4         52 non-null     float64
 5   groupable  52 non-null     object
dtypes: float64(5), object(1)
memory usage: 2.8+ KB

In [50]:
top_left_corner_df = df.iloc[:4, :4] 
top_left_corner_df

         c0        c1        c2        c3
A -0.539654 -0.572994 -1.406656  0.045272
B  1.392011 -0.140589  1.015876 -0.996384
C  1.579727  0.781952  0.321885 -1.211463
D  1.642743 -0.007436 -0.321796 -1.002238

In [51]:
df1 = df.T
df1

,A,B,C,D,E,F,G,H,I,J,...,q,r,s,t,u,v,w,x,y,z
c0,-0.539654,1.39201,1.57973,1.64274,0.772196,0.347332,0.227074,0.590816,0.561258,1.53824,...,-0.0604582,1.27761,-0.898018,-1.4072,1.04816,-0.47016,-0.509146,1.42363,0.667531,1.11253
c1,-0.572994,-0.140589,0.781952,-0.00743637,-1.27336,1.34975,-0.449105,0.65551,-1.59219,0.224297,...,0.610869,1.05639,-1.59902,0.358228,-0.00133336,-0.881317,-1.89976,0.0967842,-1.05864,0.106048
c2,-1.40666,1.01588,0.321885,-0.321796,0.493252,-0.316302,0.0569093,1.04683,0.345067,0.552589,...,-0.863758,-0.916935,-1.03536,0.677918,-0.541734,-1.01908,-0.820033,-0.766853,-0.344843,1.23828
c3,0.0452717,-0.996384,-1.21146,-1.00224,1.00221,-1.41479,0.184415,0.130521,0.699406,-0.407885,...,-0.242834,-2.13464,-1.41488,-0.14494,1.37311,0.513704,-0.213419,0.61896,1.61763,0.315124
c4,0.334597,-0.171121,-0.154783,-0.308483,0.187475,0.14595,0.284376,-0.471129,-0.664824,-0.844535,...,0.765392,0.223378,1.51402,0.047126,-0.935956,-0.802584,-0.140987,1.18664,0.526972,0.10994
groupable,b,e,c,c,a,a,e,c,a,e,...,e,e,d,d,a,d,b,c,b,c

In [52]:
l = df.axes
l

[Index(['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J', 'K', 'L', 'M', 'N',
        'O', 'P', 'Q', 'R', 'S', 'T', 'U', 'V', 'W', 'X', 'Y', 'Z', 'a', 'b',
        'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j', 'k', 'l', 'm', 'n', 'o', 'p',
        'q', 'r', 's', 't', 'u', 'v', 'w', 'x', 'y', 'z'],
       dtype='object'),
 Index(['c0', 'c1', 'c2', 'c3', 'c4', 'groupable'], dtype='object')]

In [53]:
(r_idx, c_idx) = df.axes
r_idx

Index(['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J', 'K', 'L', 'M', 'N',
       'O', 'P', 'Q', 'R', 'S', 'T', 'U', 'V', 'W', 'X', 'Y', 'Z', 'a', 'b',
       'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j', 'k', 'l', 'm', 'n', 'o', 'p',
       'q', 'r', 's', 't', 'u', 'v', 'w', 'x', 'y', 'z'],
      dtype='object')

In [54]:
c_idx

Index(['c0', 'c1', 'c2', 'c3', 'c4', 'groupable'], dtype='object')

In [59]:
 df.dtypes

c0           float64
c1           float64
c2           float64
c3           float64
c4           float64
groupable     object
dtype: object

In [60]:
df.empty

False

In [61]:
df.ndim

2

In [62]:
df.shape

(52, 6)

In [63]:
df.size

312

In [66]:
 df.head(3).values

array([[-0.5396544546512704, -0.5729941444694224, -1.406656324686357,
        0.04527166359713437, 0.3345974364941622, 'b'],
       [1.3920111406191915, -0.14058866101896858, 1.015875736653298,
        -0.9963843705206737, -0.1711210692321214, 'e'],
       [1.579727181912662, 0.7819521397181763, 0.3218845150343614,
        -1.211463058464233, -0.15478309327248754, 'c']], dtype=object)

In [67]:
df1 = df

In [ ]:
df1 = df.copy()

In [ ]:
df.rank()

In [71]:
df.sort_values(by="c0") .head()

         c0        c1        c2        c3        c4 groupable
g -1.731727 -0.919281 -2.315278  2.257602 -0.763343         a
Q -1.727055  0.556184  3.070508 -0.838413 -0.318321         a
d -1.609128 -0.066680  2.105011 -0.273137 -0.649841         d
j -1.422376  1.268995 -0.146637  1.397533  0.618906         c
t -1.407201  0.358228  0.677918 -0.144940  0.047126         d

In [ ]:
df.sort_values(by=["c0", "c1"])

In [ ]:
df.sort_index()

In [79]:
df.dtypes

c0           float64
c1           float64
c2           float64
c3           float64
c4           float64
groupable     object
dtype: object

In [87]:
df2 = df["c0"].astype("float32")
df2.dtypes

dtype('float32')

In [98]:

for i in df.head(5).iteritems():
    print(i)

('c0', A   -0.539654
B    1.392011
C    1.579727
D    1.642743
E    0.772196
Name: c0, dtype: float64)
('c1', A   -0.572994
B   -0.140589
C    0.781952
D   -0.007436
E   -1.273361
Name: c1, dtype: float64)
('c2', A   -1.406656
B    1.015876
C    0.321885
D   -0.321796
E    0.493252
Name: c2, dtype: float64)
('c3', A    0.045272
B   -0.996384
C   -1.211463
D   -1.002238
E    1.002212
Name: c3, dtype: float64)
('c4', A    0.334597
B   -0.171121
C   -0.154783
D   -0.308483
E    0.187475
Name: c4, dtype: float64)
('groupable', A    b
B    e
C    c
D    c
E    a
Name: groupable, dtype: object)

In [99]:
for i in df.head(5).iterrows():
    print(i)

('A', c0           -0.539654
c1           -0.572994
c2            -1.40666
c3           0.0452717
c4            0.334597
groupable            b
Name: A, dtype: object)
('B', c0            1.39201
c1          -0.140589
c2            1.01588
c3          -0.996384
c4          -0.171121
groupable           e
Name: B, dtype: object)
('C', c0            1.57973
c1           0.781952
c2           0.321885
c3           -1.21146
c4          -0.154783
groupable           c
Name: C, dtype: object)
('D', c0              1.64274
c1          -0.00743637
c2            -0.321796
c3             -1.00224
c4            -0.308483
groupable             c
Name: D, dtype: object)
('E', c0           0.772196
c1           -1.27336
c2           0.493252
c3            1.00221
c4           0.187475
groupable           a
Name: E, dtype: object)

In [105]:
for (name, series) in df.head(5).iteritems(): 
    print('\nCol name: ' + str(name)) 
    print('4th value: ' + str(series.iat[4]))

Col name: c0
4th value: 0.7721959820090509

Col name: c1
4th value: -1.2733608785995272

Col name: c2
4th value: 0.49325220001193704

Col name: c3
4th value: 1.002212008640696

Col name: c4
4th value: 0.18747464630591726

Col name: groupable
4th value: a

In [107]:
 df["c0"].head(5).abs()

A    0.539654
B    1.392011
C    1.579727
D    1.642743
E    0.772196
Name: c0, dtype: float64

In [112]:
df.count()

c0           52
c1           52
c2           52
c3           52
c4           52
groupable    52
dtype: int64

In [131]:
df.head(5).where(df["c0"] > 0.5, other=np.nan)

         c0        c1        c2        c3        c4 groupable
A       NaN       NaN       NaN       NaN       NaN       NaN
B  1.392011 -0.140589  1.015876 -0.996384 -0.171121         e
C  1.579727  0.781952  0.321885 -1.211463 -0.154783         c
D  1.642743 -0.007436 -0.321796 -1.002238 -0.308483         c
E  0.772196 -1.273361  0.493252  1.002212  0.187475         a

In [141]:
 df.filter(items=["a","A","z"], axis=0)

         c0        c1        c2        c3        c4 groupable
a -0.369808  1.175656 -1.080029 -0.913686 -0.081621         c
A -0.539654 -0.572994 -1.406656  0.045272  0.334597         b
z  1.112532  0.106048  1.238279  0.315124  0.109940         c

In [ ]:
df.filter(like='c')

In [ ]:
df.filter(regex='c1')

In [152]:
df.columns.values

array(['c0', 'c1', 'c2', 'c3', 'c4', 'groupable'], dtype=object)

In [153]:
df.columns.tolist()

['c0', 'c1', 'c2', 'c3', 'c4', 'groupable']

In [156]:
df.head(5).rename(columns={'c0':'c10','c1':'c11'})

        c10       c11        c2        c3        c4 groupable
A -0.539654 -0.572994 -1.406656  0.045272  0.334597         b
B  1.392011 -0.140589  1.015876 -0.996384 -0.171121         e
C  1.579727  0.781952  0.321885 -1.211463 -0.154783         c
D  1.642743 -0.007436 -0.321796 -1.002238 -0.308483         c
E  0.772196 -1.273361  0.493252  1.002212  0.187475         a

In [157]:
df.columns

Index(['c0', 'c1', 'c2', 'c3', 'c4', 'groupable'], dtype='object')

In [159]:
df.columns = ['c10', 'c11', 'c2' , 'c3' , 'c4',"groupable"]

In [160]:
df.columns

Index(['c10', 'c11', 'c2', 'c3', 'c4', 'groupable'], dtype='object')

In [162]:
df.columns[:-2]

Index(['c10', 'c11', 'c2', 'c3'], dtype='object')

In [165]:
df.pop('c10')
df.head(5)

        c11        c2        c3        c4 groupable
A -0.572994 -1.406656  0.045272  0.334597         b
B -0.140589  1.015876 -0.996384 -0.171121         e
C  0.781952  0.321885 -1.211463 -0.154783         c
D -0.007436 -0.321796 -1.002238 -0.308483         c
E -1.273361  0.493252  1.002212  0.187475         a

In [166]:
df.drop('c11', axis=1, inplace=True)

In [167]:
df.head()

         c2        c3        c4 groupable
A -1.406656  0.045272  0.334597         b
B  1.015876 -0.996384 -0.171121         e
C  0.321885 -1.211463 -0.154783         c
D -0.321796 -1.002238 -0.308483         c
E  0.493252  1.002212  0.187475         a

In [174]:
df3 = df.drop('c2', axis=1) 
df3.head()

         c3        c4 groupable
A  0.045272  0.334597         b
B -0.996384 -0.171121         e
C -1.211463 -0.154783         c
D -1.002238 -0.308483         c
E  1.002212  0.187475         a

In [178]:
np.log(df3.head(5)['c3'])

A   -3.095074
B         NaN
C         NaN
D         NaN
E    0.002210
Name: c3, dtype: float64

In [179]:
def sigmoid(x):
    return 1 / (1+np.exp(-1))

In [190]:
df3["c3"] = sigmoid(df3["c3"])

In [193]:
df.head()

         c2        c3        c4 groupable
A -1.406656  0.045272  0.334597         b
B  1.015876 -0.996384 -0.171121         e
C  0.321885 -1.211463 -0.154783         c
D -0.321796 -1.002238 -0.308483         c
E  0.493252  1.002212  0.187475         a

In [194]:
df['z'] = df['c2'].where(df['c2']>0, other=0)

In [196]:
df.head(3)

         c2        c3        c4 groupable         z
A -1.406656  0.045272  0.334597         b  0.000000
B  1.015876 -0.996384 -0.171121         e  1.015876
C  0.321885 -1.211463 -0.154783         c  0.321885

In [197]:
df['c2'].sum()

-5.10744324209698

In [198]:
 df['c2'].prod()

-2.0327741807890272e-13

In [199]:
df['c2'].cov(df['c3'])

-0.12517355725862592

In [202]:
df1 = df.drop(["groupable"],axis=1)

In [208]:
df['c2'].idxmin()

'g'

In [ ]:
df.where(df["c2"]==df['c2'].min())

In [217]:
df['c2'].head(5).round(decimals=2)

A   -1.41
B    1.02
C    0.32
D   -0.32
E    0.49
Name: c2, dtype: float64

In [226]:
df['c2'].head(5)

A   -1.406656
B    1.015876
C    0.321885
D   -0.321796
E    0.493252
Name: c2, dtype: float64

In [228]:
df['c2'].head(5).diff(periods=2)

A         NaN
B         NaN
C    1.728541
D   -1.337672
E    0.171368
Name: c2, dtype: float64

In [247]:
df[["c2","c3"]].head(5).shift(periods=1)

         c2        c3
A       NaN       NaN
B -1.406656  0.045272
C  1.015876 -0.996384
D  0.321885 -1.211463
E -0.321796 -1.002238

In [ ]:
df['c2'].pct_change(periods=1)

In [242]:
df10 = df.drop(["groupable"],axis=1)

In [253]:
df[["c2","c3"]].head(5).rolling(window=2, 
 min_periods=2, center=False).sum()

         c2        c3
A       NaN       NaN
B -0.390781 -0.951113
C  1.337760 -2.207847
D  0.000089 -2.213701
E  0.171456 -0.000026

In [255]:
df["c2"].is_unique

True

In [257]:
df["c2"].is_monotonic_increasing

False

In [258]:
df.index[0]

'A'

In [269]:
df1 = df
df1.head(5).reset_index()

  index        c2        c3        c4 groupable         z
0     A -1.406656  0.045272  0.334597         b  0.000000
1     B  1.015876 -0.996384 -0.171121         e  1.015876
2     C  0.321885 -1.211463 -0.154783         c  0.321885
3     D -0.321796 -1.002238 -0.308483         c  0.000000
4     E  0.493252  1.002212  0.187475         a  0.493252

In [270]:
df.rename(index={'A':'Z1'}, inplace=True)

In [271]:
df.head(3)

          c2        c3        c4 groupable         z
Z1 -1.406656  0.045272  0.334597         b  0.000000
B   1.015876 -0.996384 -0.171121         e  1.015876
C   0.321885 -1.211463 -0.154783         c  0.321885

In [274]:
df[df['c2'] >= 1.0]

         c2        c3        c4 groupable         z
B  1.015876 -0.996384 -0.171121         e  1.015876
H  1.046830  0.130521 -0.471129         c  1.046830
Q  3.070508 -0.838413 -0.318321         a  3.070508
Y  1.333566  1.731109  1.546093         a  1.333566
Z  1.014570 -0.657160  0.900181         b  1.014570
d  2.105011 -0.273137 -0.649841         d  2.105011
f  1.950197 -0.347727  0.204425         d  1.950197
z  1.238279  0.315124  0.109940         c  1.238279

In [276]:
# fake up some data 
data = {1:[1,2,3], 2:[1,4,9], 3:[1,8,27]} 
df = DataFrame(data) 
# multi-column isin 
lf = {1:[1, 3], 3:[8, 27]} # look for 
f = df[df[list(lf)].isin(lf).all(axis=1)]
f

   1  2   3
2  3  9  27